{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 28, 28, 3], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_7", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_8", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_9", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "units": 63}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.4", "class_name": "Sequential"}