{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "batch_input_shape": [null, 28, 28, 3], "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "conv2d_1", "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 63, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.4"}