{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_6"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "name": "conv2d_7"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "units": 63, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Sequential"}